Revit 2027 API
SiteLocation.TimeZone Property
 The time-zone for the site.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TimeZone { get; set; }
Public Property TimeZone As Double
	Get
	Set
public:
property double TimeZone {
	double get ();
	void set (double value);
}
member TimeZone : float with get, set
Property Value
Double
 Hours ranging from -12 to +12. 0 represents GMT. Note that if the input value is not in the valid range, it will be shifted by multiples of 24 until it is in range.
Remarks
Remarks
A property that returns the time zone in which the site resides. The value is in hours, ranging from +12 hours to -12 hours with 0 being GMT. If the input value is not in the valid range, it will be shifted by multiples of 24 until it is in range.
Set this property directly if for your desired latitude and longitude, Revit's calculation does not match with the actual time zone for your location. Note that there are no restrictions preventing you from setting this to an incorrect value for the site location, and incorrect times for Solar Studies may result.
See Also
Reference
SiteLocation Class
Autodesk.Revit.DB Namespace